#lang racket
;(1) Преведете следните аритметични изрази на Scheme.
;Ако не знаете името на функцията, смятаща някоя от аритметичните
;операции, използвайте документацията

;(3 + 5)/2 + √(4² - 7*2²)
(+ (/ (+ 3 5) 2) (sqrt (- (* 4 4) (* 7 (* 2 2)))))

;(5 + 1/4 + (2 - (3 - (6 + 1/5)))) / 3(6 - 2)(2 - 7)
(
 /
 (
  +
  5
  (/ 1 4)
  (
   -
   2
   (
    -
    3
    (
     +
     6
     (/ 1 5)
     )
    )
   )
  )
 (*
  3
  (- 6 2)
  (- 2 7))
 )

;(15 + 21 + (3 / 15) + (7 - (2 * 2))) / 16
(
 /
 (+
  15
  21
  (/ 3 15)
  (- 7
     (* 2 2))
  )
 16
 )

;OK